<?xml version='1.0' encoding='UTF-8' ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
      xmlns:ui="http://xmlns.jcp.org/jsf/facelets"
      xmlns:h="http://xmlns.jcp.org/jsf/html">
    <ui:composition template="template/template.xhtml">
        <ui:define name="navigation">
            <ui:include src="navigation.xhtml">
                <ui:param name="activeElement" value="home"/>
            </ui:include>        
        </ui:define>
        <ui:define name="pageContent">
            <div class="row">
                <div class="col-12">
                    <h2>Home</h2>
                    <hr/>
                </div>
                <div class="col-12">
                    <a class="btn btn-info btn-block btn-lg text-toggle" data-toggle="collapse" href="#informationDiv" aria-expanded="false" aria-controls="informationDiv">
                        <span class="text-collapsed">Zeige Infos f&uuml;r Tester</span>
                        <span class="text-expanded">Verstecke Infos f&uuml;r Tester</span>
                    </a>
                    <div class="collapse" id="informationDiv">
                        <div class="card card-inverse">
                            <div class="card-body">
                                <h3>Allgemeine Informationen</h3>
                                <p>Meine Festival Planer Webseite ist nicht daf&uuml;r da Tickets online zu erwerben, sondern ist eine rein informative Plattform, 
                                    um einen &Uuml;berblick zu bekommen welche Festivals in Deutschland stattfinden und detaillierte Informationen zu diesen 
                                    Events (z.B. Ticketarten, Campingvarianten, Lineup, Timetable) anzuzeigen. Zus&auml;tzlich werden auch Bands verwaltet, die 
                                    dann wiederum im Lineup eines oder mehrerer Festivals auftauchen k&ouml;nnen und somit ein schneller &Uuml;berblick verschafft wird, 
                                    wann und wo die Band ihre Auftritte hat.</p>
                                <h3>Organisatorische Anweisungen</h3>
                                <p>Um ein neues Festival einzutragen oder eines zu &auml;ndern, muss auf den Button "Daten eintragen" in der Navigationsleiste gedr&uuml;ckt werden.<br/>
                                    Auf dieser Seite k&ouml;nnen ebenso auch neue Bands eingetragen werden. Freigegebene Bands und Festivals k&oouml;nnen &uuml;ber die jeweils daf&uuml;r vorgesehenen Men&uuml;punkte gesucht werden.</p>
                                <h5>1. Neues Festival eintragen</h5>
                                <p>
                                    Beim Eintragen eines neuen Festivals werden folgende Schritte ausgef&uuml;hrt:                            
                                    <ul>
                                        <li>
                                            Schritt 1: Eintragen der allgemeinen Festivaldaten, Zusatzeigenschaften und Location
                                        </li>
                                        <li>
                                            Schritt 2: Eintragen der Ticketarten und Campingvarianten, die angeboten werden
                                        </li>
                                        <li>
                                            Schritt 3: Eintragen des Lineups, also welche Bands auf dem Festival spielen. Da es aber oft noch nicht bekannt ist wann genau und auf 
                                            welcher B&uuml;hne eine Band spielt, sind diese Informationen optional. Um nicht zwischen den verschiedenen Bearbeitungsmasken zu wechseln, 
                                            ist es auch hier m&ouml;glich neue Bands hinzuzuf&uuml;gen.
                                        </li>
                                    </ul>
                                    Nachdem das Festival erstellt wurde, ist dieses aber noch nicht sichtbar in der &Uuml;bersicht (Startbildschirm) oder in der Festivalsuche.
                                    Das Festival muss erst vom Admin freigeschalten werden, damit nicht unn&ouml;tig viele Duplikate eingestellt werden oder Festivals angelegt werden, 
                                    die einen rassistischen oder anders politisch inkorrekten Hintergrund haben.<br/>
                                    Ausnahme: Wenn Sie direkt als Admin eingeloggt sind, dann wird das Festival direkt auch freigegeben.
                                </p>
                                <h5>2. Festivaldaten erg&auml;nzen</h5>
                                <p>
                                    Festivals &auml;ndern kann man entweder, wenn man die Detailansicht eines Festivals ge&ouml;ffnet hat oder wenn man den Punkt "Festivaldaten eintragen" in der Navigationsleiste dr&uuml;ckt
                                    und dort das Formular "Daten f&uuml;r Festival erg&auml;nzen" &ouml;ffnen. <br/>
                                    Zuerst muss das zu &auml;ndernde Festival aus der Dropdown-Box ausgew&auml;hlt werden.
                                    Beim &Auml;ndern eines Festivals werden folgende Schritte ausgef&uuml;hrt:                            
                                    <ul>
                                        <li>
                                            Schritt 1: &Auml;ndern und Erg&auml;nzen von bestimmten Festivaldaten (z.B. Ticketanzahl, Veranstalter, Zusatzeigenschaften). Einige der Festivaldaten d&uuml;rfen im Nachhinein nicht mehr ge&auml;ndert werden.
                                        </li>
                                        <li>
                                            Schritt 2: Eintragen und &Auml;ndern der Ticketarten und Campingvarianten, die angeboten werden
                                        </li>
                                        <li>
                                            Schritt 3: Eintragen und &Auml;ndern des Lineups analog zu neuen Festivals (siehe Punkt 1: Neues Festival eintragen).
                                        </li>
                                    </ul>
                                    Ge&auml;nderte Festivals werden sofort &uuml;bernommen. Es bedarf keiner weiteren Freigabe des Administrators.
                                </p>
                                <h5>3. Bands eintragen</h5>
                                <p>
                                    Neue Bands k&ouml;nnen ebenfalls &uuml;ber "Festivaldaten eintragen" in der Navigationsleiste angelegt werden. <br/>
                                    Die Bands werden wie die Festivals jedoch nicht sofort angezeigt, sondern m&uuml;ssen erst wieder vom Administrator freigegeben werden.
                                    Auch hier gilt wieder die Ausnahme, dass die Band sofort freigegeben wird, wenn der Admin eingeloggt ist. 
                                </p>
                                <h5>4. Bands und Festivals suchen</h5>
                                <p>
                                    Wie bereits weiter oben kurz angedeutet, k&ouml;nnen freigegebene Bands und Festivals &uuml;ber den jeweiligen Navigationspunkt gesucht werden.
                                    Daf&uuml;r werden Filter bereitgestellt, um die Zahl der angezeigten Eintr&auml;ge zu reduzieren. Um detaillierte Infos zu einem Festival oder einer Band
                                    zu erhalten, kann entweder auf den Namen oder auf den Link "zeige Details" geklickt werden.
                                </p>
                                <h5>5. Detailanzeige von Festivals und Bands</h5>
                                <p>
                                    In der Detailanzeige werden genauere Informationen f&uuml;r Festivals oder Bands dargestellt.
                                     <ul>
                                        <li>
                                            Festivals: Die Location (Google-Maps) und die Zusatzeigenschaften (in Form von Icons) werden zusammen mit den 
                                            Wetterdaten (Live-Abfrage per Webservice auf den Wetterdienst von Maximilian Fries) im oberen Bereich angezeigt. <br/>
                                            Daraufhin folgen die Campingvarianten und Ticketarten.<br/>
                                            Danach werden alle Bands aufgelistet (Lineup), die an dem Festival teilnehmen und darunter (falls die Informationen verf&uuml;gbar sind) 
                                            der genaue Timetable, um zu sehen welche Band wann auf welcher B&uuml;hne spielt.<br/>
                                            Au&szlig;erdem kann das Festival &uuml;ber den Button "Festivaldaten &auml;ndern" ge&auml;ndert oder &uuml;ber den Button "Festival l&ouml;schen" gel&ouml;scht werden.
                                            Allerdings wird das Festival nicht sofort gel&ouml;scht, sondern nur die L&ouml;schung beantragt, die dann vom Administrator best&auml;tigt werden muss.
                                        </li>
                                        <li>
                                            Bands: Die Beschreibung der Band wird angezeigt sowie einen Link zur Homepage und zur Facebookseite, falls vorhanden. Au&szlig;erdem werden die Auftritte angezeigt, also die Festivals auf denen die Band spielt.<br/>
                                            Wie bei Festivals kann auch die L&ouml;schung der Band beantragt werden, die wiederum vom Administrator best&auml;tigt werden muss.
                                        </li>
                                    </ul>
                                </p>
                                <h3>Technische Hinweise</h3>
                                <p>
                                    Erf&uuml;llte Requirements (sollten eigentlich alle geforderten MUSS-Requirements abdecken):
                                    <ul>
                                        <li>
                                            JAX-WS-Webserivce: Es gibt eine Webservicemethode, um alle freigegebenen Festivals zur&uuml;ck zu liefern, allerdings ohne detaillierte Daten wie z.B. Lineupdaten, Ticketvarianten und Wetterdaten.
                                            Um diese detaillierte Daten zu bekommen, gibt es eine zweite Webservicemethode, die dann diese Daten liefert. Der EventEvaluator von Markus Biersack nutzt die Webservice-Klasse, die diese Methoden bereitstellt.
                                        </li>
                                        <li>
                                            CDI:  Producer-Methode zum Erzeugen eines Loggers (<code>LoggerFactory</code>), Qualifier f&uuml;r verschiedene Validator-Klassen (<code>FormValidatorFactory</code>)
                                        </li>
                                        <li>
                                            Datenpersistenz: ElementCollection, Kaskadierung und OrphanRemoval wird genutzt. JPQL Queries sind in den jeweiligen Entities vorhanden. MappedSuperclass wird f&uuml;r die Basisklasse (<code>AbstractLongEntity</code>) von Entities verwendet.
                                        </li>
                                        <li>
                                            Web-Benutzeroberfl&auml;che: JSF-Pages inlusivem Template f&uuml;r das Basisdesign und ein paar weiteren "HTML-Schnipsel" 
                                            (im Unterordner "partials"), die von verschiedenen XHTML-Seiten verwendet werden z.B. das Formular zum Eintragen von Bands 
                                            (<code>bandForm.xhtml</code>). F&uuml;r Enums wurde eine generische Converter-Klasse (<code>GenericEnumConverter</code>)verwendet.
                                        </li>
                                        <li>
                                            CDI- und EJB-Nutzung: <code>@Transactional</code> wird auf Klassenebene in den <code>*RepositoryImpl</code>-Klassen verwendet.
                                        </li>
                                        <li>
                                            Integration mit Partnerprojekten: Meine Anwendung nutzt den Wetterdienst von Maximilian Fries. Der EventEvaluator von Markus Biersack nutzt meinen Webservice.
                                        </li>
                                    </ul>
                                    Zus&auml;tzlich habe ich noch einen Interceptor (<code>LoggingInterceptor</code>) verwendet, um automatisch die aufgerufenen Methode, die &uuml;bergebenen Parameter, die R&uuml;ckgabewerte und die Dauer des Aufrufs zu protokollieren.<br/>
                                    Mittels CDI-Events (<code>UpdateEvent, RemoveEvent</code>) aktualisiere ich beispielsweise das Formular zum Eintragen eines neuen Lineups, damit neu hinzugef&uuml;gte Bands sofort ausw&auml;hlbar sind.
                                    
                                </p>
                            </div>
                        </div>
                    </div>
                </div>
                <div class="col-12">
                    <h3>Die n&auml;chsten Festivals</h3>
                </div>
                <h:form class="col-12">
                    <div class="row">
                        <ui:repeat var="festival" value="#{homeContentBean.getUpcomingFestivals(3)}" varStatus="status">
                            <div class="col-4">
                                <ui:include src="/partials/festivalCard.xhtml">
                                    <ui:param name="festival" value="#{festival}" />
                                </ui:include>
                            </div>
                        </ui:repeat>
                        <div class="col-12">
                            <h3>Zuf&auml;llige Bands</h3>
                        </div>
                        <ui:repeat var="band" value="#{homeContentBean.getRandomBands(6)}">
                            <div class="col-4">
                                <ui:include src="/partials/bandCard.xhtml">
                                    <ui:param name="band" value="#{band}" />
                                </ui:include>
                            </div>
                        </ui:repeat>
                    </div>
                </h:form>
            </div>
        </ui:define>
    </ui:composition>
</html>